## PART 1

In [2]:
import pandas as pd

df_cricket = pd.DataFrame()

In [3]:
names = ['Sachin Tendulkar','VVS Laxman','Rahul Dravid','M S Dhoni','Jacques Kallis','Faf Duplesis','A B Devillers']

runs = [1937,1511,1672,1200,1400,800,1700]

centuries = [7,5,9,4,7,3,8]

In [4]:
df_cricket['names'] = names
df_cricket['runs'] = runs
df_cricket['centuries'] = centuries

In [5]:
df_cricket

              names  runs  centuries
0  Sachin Tendulkar  1937          7
1        VVS Laxman  1511          5
2      Rahul Dravid  1672          9
3         M S Dhoni  1200          4
4    Jacques Kallis  1400          7
5      Faf Duplesis   800          3
6     A B Devillers  1700          8

In [6]:
df_cricket['runs_rank'] = df_cricket['runs'].rank(ascending=False)
df_cricket.sort_values('runs_rank')

              names  runs  centuries  runs_rank
0  Sachin Tendulkar  1937          7        1.0
6     A B Devillers  1700          8        2.0
2      Rahul Dravid  1672          9        3.0
1        VVS Laxman  1511          5        4.0
4    Jacques Kallis  1400          7        5.0
3         M S Dhoni  1200          4        6.0
5      Faf Duplesis   800          3        7.0

In [7]:
df_cricket['runs_rank'] = df_cricket['runs'].rank(ascending=True)
df_cricket.sort_values('runs_rank')

              names  runs  centuries  runs_rank
5      Faf Duplesis   800          3        1.0
3         M S Dhoni  1200          4        2.0
4    Jacques Kallis  1400          7        3.0
1        VVS Laxman  1511          5        4.0
2      Rahul Dravid  1672          9        5.0
6     A B Devillers  1700          8        6.0
0  Sachin Tendulkar  1937          7        7.0

In [8]:
df_cricket['centuries_rank'] = df_cricket['centuries'].rank(ascending=False)
df_cricket.sort_values('centuries_rank')

              names  runs  centuries  runs_rank  centuries_rank
2      Rahul Dravid  1672          9        5.0             1.0
6     A B Devillers  1700          8        6.0             2.0
0  Sachin Tendulkar  1937          7        7.0             3.5
4    Jacques Kallis  1400          7        3.0             3.5
1        VVS Laxman  1511          5        4.0             5.0
3         M S Dhoni  1200          4        2.0             6.0
5      Faf Duplesis   800          3        1.0             7.0

In [9]:
df_cricket

              names  runs  centuries  runs_rank  centuries_rank
0  Sachin Tendulkar  1937          7        7.0             3.5
1        VVS Laxman  1511          5        4.0             5.0
2      Rahul Dravid  1672          9        5.0             1.0
3         M S Dhoni  1200          4        2.0             6.0
4    Jacques Kallis  1400          7        3.0             3.5
5      Faf Duplesis   800          3        1.0             7.0
6     A B Devillers  1700          8        6.0             2.0

## Part 2

In [10]:
import pandas as pd

df = pd.DataFrame()

df['col1'] = pd.Series(['Venkat Narayan', 'Dupesh Singh', 'Jatin Khanna', 'Rekha pandey', 'Majid Khan'])
df['col2'] = pd.Series(['rashid khan', 'manoj pillai', 'narender darwani', 'arshi siddiqui', 'joseph johnson'])
df['col3'] = pd.Series([ '100', 'True', 'Alisha', '555.987'])

In [11]:
df

             col1              col2     col3
0  Venkat Narayan       rashid khan      100
1    Dupesh Singh      manoj pillai     True
2    Jatin Khanna  narender darwani   Alisha
3    Rekha pandey    arshi siddiqui  555.987
4      Majid Khan    joseph johnson      NaN

In [13]:
#lower case
df['col1'].str.lower()

0    venkat narayan
1      dupesh singh
2      jatin khanna
3      rekha pandey
4        majid khan
Name: col1, dtype: object

In [14]:
# Upper 
df['col2'].str.upper()

0         RASHID KHAN
1        MANOJ PILLAI
2    NARENDER DARWANI
3      ARSHI SIDDIQUI
4      JOSEPH JOHNSON
Name: col2, dtype: object

In [15]:
#capitalize
df['col1'].str.capitalize()
df['col2'].str.capitalize()

0         Rashid khan
1        Manoj pillai
2    Narender darwani
3      Arshi siddiqui
4      Joseph johnson
Name: col2, dtype: object

In [16]:
#Title
df['col1'].str.title()
df['col2'].str.title()

0         Rashid Khan
1        Manoj Pillai
2    Narender Darwani
3      Arshi Siddiqui
4      Joseph Johnson
Name: col2, dtype: object

In [17]:
#Split

df['col1'].str.split()

0    [Venkat, Narayan]
1      [Dupesh, Singh]
2      [Jatin, Khanna]
3      [Rekha, pandey]
4        [Majid, Khan]
Name: col1, dtype: object

In [18]:
#endswith
df['col1'].str.endswith('an')
df['col2'].str.endswith('an')

0     True
1    False
2    False
3    False
4    False
Name: col2, dtype: bool

In [19]:
#find
df['col2'].str.find('dar')

0   -1
1   -1
2    9
3   -1
4   -1
Name: col2, dtype: int64

In [20]:
#isalpha
df['col3'].str.isalnum()

0     True
1     True
2     True
3    False
4      NaN
Name: col3, dtype: object

In [21]:
#isdigit
df['col3'].str.isdigit()

0     True
1    False
2    False
3    False
4      NaN
Name: col3, dtype: object